Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Destroy(Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel)
Delete the created analytical model and the analytical elements such as spaces, surfaces, and openings.
model:
The model will be destroyed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions)
Creates a new energy analysis detailed model.
Remarks:
The generated energy model is always returned in world coordinates.
The method TransformModel() transforms all surfaces in the model according to
ground plane, shared coordinates and true north.
document:
The document that contains the physical model of the building.
options:
The options to control the calculation rules.
Returns:
The created model instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Throws if there are no valid spatial bounding elements,
or no valid spatial elements in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the energy analysis detail model.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Throws if user aborted the energy analysis detail model creation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
Manage the analytical thermal model.
Remarks:
The Export to gbXML and the Heating and Cooling Loads features
produces an analytical thermal model from the physical model
of a building. The analytical thermal model is composed of
spaces, zones and planar surfaces that represent the actual
volumetric elements of the building.
The EnergyAnaysisDetailModel is intended to be generated and
used immediately - none of the data or relationships that it contains
are updated as changes are made to the corresponding Revit model.
Dispose of the generated EnergyAnaysisDetailModel using the Destroy() method
as soon as you have extracted the needed information.
Since:
2012